/**			                                                    
   
  ******************************************************************************
  * @作  者  Musk Han@XTARK
  * @内  容  机器人灯效控制
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AX_LIGHT_H
#define __AX_LIGHT_H

/* Includes ------------------------------------------------------------------*/	 
//#include "stm32f10x.h"

//X-SOFT 接口函数
void AX_LIGHT_Show(void);//灯效显示函数

#endif

    
